tag_groups = {
    "Апартаменты": [
        "apartment", "Апартамент", "Apartment", "апартаменты", "Апартаменты", "Аппартаменты", "Гостиничный номер"
    ],
    "Квартира": [
        "flat", "квартира", "Квартира", "жилая", "Пентхаус", "студия", "Студия", "residential", "Резиденция", "Свободная планировка"
    ],
    "Машино-место": [
        "гараж", "Паркинг", "parking", "Парковка", "Машиноместо", "паркинг", "Машино-место"
    ],
    "Загородная недвижимость": [
        "Вилла", "Загородная недвижимость", "house"
    ],
    "Таунхаус": [
        "Таунхаус"
    ],
    "Кладовка": [
        "non-residential", "Кладовая", "Кладовка"
    ],
    "Коммерческая недвижимость": [
        "Коммерция", "Коммерческая недвижимость", "Коммерческое помещение", "Торговое помещение"
    ]
}

type_to_tag = {synonym: tag for tag, synonyms in tag_groups.items() for synonym in synonyms}

def func(*args, **kwargs):
    if not args:
        return None
    type_value = args[0]
    return type_to_tag.get(type_value, None) 